# **Gözlem ve Değişken Seçimi: Ioc & iloc**

In [1]:
import numpy as np
import pandas as pd
m = np.random.randint(1,30,size=(10,3))
df = pd.DataFrame(m,columns=["var1","var2","var3"])
df

   var1  var2  var3
0    12    17    25
1    15    13    27
2     8    13     5
3    13    17     8
4    16     1    12
5     5     3     9
6     5     4    10
7    21    20     7
8    27    11    26
9    19    22    11

### loc: tanımlandığı şekli ile seçim yapmak için kullanılır.

In [2]:
df.loc[0:3]

   var1  var2  var3
0    12    17    25
1    15    13    27
2     8    13     5
3    13    17     8

### iloc: alışık olduğumuz indeksleme mantığı ile seçim yapar.

In [3]:
df.iloc[0:3]

   var1  var2  var3
0    12    17    25
1    15    13    27
2     8    13     5

In [4]:
df.iloc[0,0]

12

In [5]:
df

   var1  var2  var3
0    12    17    25
1    15    13    27
2     8    13     5
3    13    17     8
4    16     1    12
5     5     3     9
6     5     4    10
7    21    20     7
8    27    11    26
9    19    22    11

In [6]:
df.iloc[:3,:2]

   var1  var2
0    12    17
1    15    13
2     8    13

In [7]:
df.loc[0:3,"var3"]

0    25
1    27
2     5
3     8
Name: var3, dtype: int32

In [10]:
df.iloc[0:3]["var3"]

0    25
1    27
2     5
Name: var3, dtype: int32